/*
Задание:
Разработайте программу, которая выбросит Exception, когда пользователь вводит пустую строку.
Пользователю должно показаться сообщение, что пустые строки вводить нельзя.
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}